configuration/src/Reports/PollStatistics/PollStatistics.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>PollStatistics</name>
</mdclass:Report>

configuration/src/InformationRegisters/QuestionnaireQuestionAnswers/QuestionnaireQuestionAnswers.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>QuestionnaireQuestionAnswers</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Response</name>
    <type>
      <types>Characteristic.QuestionsForSurvey</types>
    </type>
  </resources>
  <attributes>
    <name>OpenAnswer</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>IsUnanswered</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Questionnaire</name>
    <type>
      <types>DocumentRef.Questionnaire</types>
    </type>
  </dimensions>
  <dimensions>
    <name>DoQueryBox</name>
    <type>
      <types>CatalogRef.QuestionnaireTemplateQuestions</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ElementaryQuestion</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.QuestionsForSurvey</types>
    </type>
  </dimensions>
  <dimensions>
    <name>CellNumber</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/Enums/TabularQuestionTypes/TabularQuestionTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>TabularQuestionTypes</name>
  <enumValues>
    <name>Composite</name>
  </enumValues>
  <enumValues>
    <name>PredefinedAnswersInRows</name>
  </enumValues>
  <enumValues>
    <name>PredefinedAnswersInColumns</name>
  </enumValues>
  <enumValues>
    <name>PredefinedAnswersInRowsAndColumns</name>
  </enumValues>
</mdclass:Enum>

configuration/src/Documents/Questionnaire/Questionnaire.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Questionnaire</name>
  <registerRecords>InformationRegister.QuestionnaireQuestionAnswers</registerRecords>
  <attributes>
    <name>Survey</name>
    <type>
      <types>DocumentRef.PollPurpose</types>
    </type>
  </attributes>
  <attributes>
    <name>Respondent</name>
    <type>
      <types>DefinedType.Respondent</types>
    </type>
  </attributes>
  <attributes>
    <name>EditDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>SectionToEdit</name>
    <type>
      <types>CatalogRef.QuestionnaireTemplateQuestions</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Interviewer</name>
    <type>
      <types>DefinedType.Interviewer</types>
    </type>
  </attributes>
  <attributes>
    <name>QuestionnaireTemplate</name>
    <type>
      <types>CatalogRef.QuestionnaireTemplates</types>
    </type>
  </attributes>
  <attributes>
    <name>SurveyMode</name>
    <type>
      <types>EnumRef.SurveyModes</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Content</name>
    <attributes>
      <name>DoQueryBox</name>
      <type>
        <types>CatalogRef.QuestionnaireTemplateQuestions</types>
      </type>
    </attributes>
    <attributes>
      <name>ElementaryQuestion</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.QuestionsForSurvey</types>
      </type>
    </attributes>
    <attributes>
      <name>CellNumber</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Response</name>
      <type>
        <types>Characteristic.QuestionsForSurvey</types>
      </type>
    </attributes>
    <attributes>
      <name>OpenAnswer</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>IsUnanswered</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

configuration/src/ChartsOfCharacteristicTypes/QuestionsForSurvey/QuestionsForSurvey.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>QuestionsForSurvey</name>
  <type>
    <types>Boolean</types>
    <types>String</types>
    <types>Date</types>
    <types>Number</types>
    <types>CatalogRef.QuestionnaireAnswersOptions</types>
    <numberQualifiers>
      <precision>15</precision>
      <scale>3</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>1024</length>
    </stringQualifiers>
    <dateQualifiers>
      <dateFractions>Date</dateFractions>
    </dateQualifiers>
  </type>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Wording</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ReplyType</name>
    <type>
      <types>EnumRef.TypesOfAnswersToQuestion</types>
    </type>
  </attributes>
  <attributes>
    <name>CommentRequired</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CommentNote</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AutoFill</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Length</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>MinValue</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>MaxValue</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Accuracy</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ShowAggregatedValuesInReports</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>RadioButtonType</name>
    <type>
      <types>EnumRef.RadioButtonTypesInQuestionnaires</types>
    </type>
  </attributes>
  <attributes>
    <name>CheckBoxType</name>
    <type>
      <types>EnumRef.CheckBoxKindsInQuestionnaires</types>
    </type>
  </attributes>
  <attributes>
    <name>ShouldUseMinValue</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ShouldUseMaxValue</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ShouldShowRangeSlider</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>RangeSliderStep</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ShouldShowHintForNumericalQuestions</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>NumericalQuestionHintsRange</name>
    <attributes>
      <name>ValueUpTo</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ToolTip</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

configuration/src/Reports/PollStatistics/Forms/TableQuestionsDetails/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//

#Region EventHandlersForm

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	BasicQuestionsFormulations = New Map;
	
	If ProcessIncomingParameters(BasicQuestionsFormulations) Then
		Cancel = True;
		Return;
	EndIf;
	
	GenerateReport(BasicQuestionsFormulations);
	
EndProcedure

#EndRegion

#Region Private

&AtServer
Procedure GenerateReport(BasicQuestionsFormulations)

	ReportTable.Clear();
	
	QueryResult = ExecuteQueryOnQuestionnareQuestion();
	If QueryResult.IsEmpty() Then
		Return;
	EndIf;
	
	Template = Reports.PollStatistics.GetTemplate("AnswersTemplate");
	
	Area = Template.GetArea("DoQueryBox");
	Area.Parameters.QuestionWording = Wording;
	ReportTable.Put(Area,1);
	
	AnswersTree = QueryResult.Unload(QueryResultIteration.ByGroups);
	For Each TreeRow In AnswersTree.Rows Do
		OutputToRespondentsDocument(TreeRow,Template,BasicQuestionsFormulations);
	EndDo;

EndProcedure

&AtServer
Procedure OutputToRespondentsDocument(TreeRow,Template, BasicQuestionsFormulations)

	Area = Template.GetArea("Respondent");
	Area.Parameters.Respondent = TreeRow.Respondent;
	ReportTable.Put(Area,1);
	
	ReportTable.StartRowGroup(TreeRow.Respondent);
	OutputTabularAnswer(TreeRow,Template,BasicQuestionsFormulations);
	ReportTable.EndRowGroup();

EndProcedure

&AtServer
Procedure OutputTabularAnswer(TreeRow,Template,BasicQuestionsFormulations)

	If TabularQuestionType = Enums.TabularQuestionTypes.Composite Then
		
		OutputAnswerCompositeTabularQuestion(TreeRow,Template,BasicQuestionsFormulations);
		
	ElsIf TabularQuestionType = Enums.TabularQuestionTypes.PredefinedAnswersInColumns Then
		
		OutputAnswerPredefinedAnswersInColumnsTabularQuestion(TreeRow,Template, BasicQuestionsFormulations);
		
	ElsIf TabularQuestionType = Enums.TabularQuestionTypes.PredefinedAnswersInRows Then
		
		OutputAnswerPredefinedAnswersInRowsTabularQuestion(TreeRow,Template, BasicQuestionsFormulations);
		
	ElsIf TabularQuestionType = Enums.TabularQuestionTypes.PredefinedAnswersInRowsAndColumns Then
		
		OutputAnswerPredefinedAnswersInRowsAndColumnsTabularQuestion(TreeRow,Template);
		
	EndIf;

EndProcedure

&AtServer
Procedure OutputAnswerCompositeTabularQuestion(TreeRow,Template, BasicQuestionsFormulations)
	
	FirstColumn = True;
	
	For Each DoQueryBox In TableQuestionComposition Do
		
		If FirstColumn Then
			Area = Template.GetArea("Indent");
			ReportTable.Put(Area);
			FirstColumn = False;
		EndIf;
		
		Area = Template.GetArea("TableQuestionHeaderItem");
		Area.Parameters.Value = BasicQuestionsFormulations.Get(DoQueryBox.ElementaryQuestion);
		ReportTable.Join(Area);
		
	EndDo; 
	
	FirstColumn = True;
	
	For Each TreeRowCell In TreeRow.Rows Do
		
		FirstColumn = True;
		
		For Each TabularQuestionContentRow In TableQuestionComposition Do
			
			FoundRow = TreeRowCell.Rows.Find(TabularQuestionContentRow.ElementaryQuestion,"ElementaryQuestion");
			
			If FirstColumn Then
				Area = Template.GetArea("Indent");
				ReportTable.Put(Area);
				FirstColumn = False;
			EndIf;
			
			Area = Template.GetArea("TableQuestionCell");
			Area.Parameters.Value = ?(FoundRow = Undefined,"",FoundRow.Response);
			ReportTable.Join(Area);
			
		EndDo;
		
	EndDo;
	
EndProcedure

&AtServer
Procedure OutputAnswerPredefinedAnswersInColumnsTabularQuestion(TreeRow,Template, BasicQuestionsFormulations)

	Area = Template.GetArea("Indent");
	ReportTable.Put(Area);
	
	Area = Template.GetArea("TableQuestionHeaderItem");
	ReportTable.Join(Area);
	
	For Each Response In PredefinedAnswers Do
		
		Area = Template.GetArea("TableQuestionHeaderItem");
		Area.Parameters.Value = Response.Response;
		ReportTable.Join(Area);
		
	EndDo;	
	
	For RowsIndex = 2 To TableQuestionComposition.Count() Do
		
		Area = Template.GetArea("Indent");
		ReportTable.Put(Area);
		
		Area = Template.GetArea("TableQuestionHeaderItem");
		Area.Parameters.Value = BasicQuestionsFormulations.Get(TableQuestionComposition[RowsIndex - 1].ElementaryQuestion);
		ReportTable.Join(Area);
		
		For ColumnsIndex = 1 To PredefinedAnswers.Count() Do
			
			FilterStructure1 = New Structure;
			FilterStructure1.Insert("ElementaryQuestion", TableQuestionComposition[RowsIndex-1].ElementaryQuestion);
			FilterStructure1.Insert("CellNumber",ColumnsIndex);
			FoundRows = TreeRow.Rows.FindRows(FilterStructure1,True);
			
			Area = Template.GetArea("TableQuestionCell");
			If FoundRows.Count() > 0 Then
				Area.Parameters.Value = FoundRows[0].Response;
			EndIf;
			ReportTable.Join(Area);
			
		EndDo;
	EndDo;
	
EndProcedure

&AtServer
Procedure OutputAnswerPredefinedAnswersInRowsTabularQuestion(TreeRow,Template, BasicQuestionsFormulations)

	FirstColumn = True;
	
	For Each DoQueryBox In TableQuestionComposition Do
		
		If FirstColumn Then
			Area = Template.GetArea("Indent");
			ReportTable.Put(Area);
			FirstColumn = False;
		EndIf;
		
		Area = Template.GetArea("TableQuestionHeaderItem");
		Area.Parameters.Value = BasicQuestionsFormulations.Get(DoQueryBox.ElementaryQuestion);
		ReportTable.Join(Area);
		
	EndDo;
	
	For Each TreeRowCell In TreeRow.Rows Do
		
		FirstColumn = True;
		
		For ColumnsIndex = 1 To TableQuestionComposition.Count() Do
			
			If FirstColumn Then
				
				Area = Template.GetArea("Indent");
				ReportTable.Put(Area);
				FirstColumn = False;
				
				Area = Template.GetArea("TableQuestionCellItemPredefinedAnswer");
				Area.Parameters.Value = PredefinedAnswers[TreeRowCell.CellNumber - 1].Response;
				ReportTable.Join(Area);
				
			Else
				
				FoundRow = TreeRowCell.Rows.Find(TableQuestionComposition[ColumnsIndex - 1].ElementaryQuestion,"ElementaryQuestion");
				
				Area = Template.GetArea("TableQuestionCell");
				Area.Parameters.Value = ?(FoundRow = Undefined,"",FoundRow.Response);

				ReportTable.Join(Area);
				
			EndIf;
			
		EndDo;
	EndDo;
	
EndProcedure

&AtServer
Procedure OutputAnswerPredefinedAnswersInRowsAndColumnsTabularQuestion(TreeRow,Template)
	
	ColumnsAnswers = PredefinedAnswers.FindRows(New Structure("ElementaryQuestion",TableQuestionComposition[1].ElementaryQuestion));
	RowsAnswers = PredefinedAnswers.FindRows(New Structure("ElementaryQuestion",TableQuestionComposition[0].ElementaryQuestion));
	
	If ColumnsAnswers.Count() = 0 And RowsAnswers.Count() = 0 Then
		Return;
	EndIf;
	
	Area = Template.GetArea("Indent");
	ReportTable.Put(Area);
	
	Area = Template.GetArea("TableQuestionHeaderItem");
	ReportTable.Join(Area);
	
	For Each Response In ColumnsAnswers Do
		
		Area = Template.GetArea("TableQuestionHeaderItem");
		Area.Parameters.Value = Response.Response;
		ReportTable.Join(Area);
		
	EndDo;
	
	For RowIndex = 1 To RowsAnswers.Count()  Do
		
		Area = Template.GetArea("Indent");
		ReportTable.Put(Area);
		
		Area = Template.GetArea("TableQuestionHeaderItem");
		Area.Parameters.Value = RowsAnswers[RowIndex - 1].Response;
		ReportTable.Join(Area);
		
		For ColumnIndex = 1 To ColumnsAnswers.Count() Do
			
			FilterStructure1 = New Structure;
			FilterStructure1.Insert("CellNumber", ColumnIndex + (RowIndex-1) * ColumnsAnswers.Count());
			FilterStructure1.Insert("ElementaryQuestion",TableQuestionComposition[2].ElementaryQuestion);
			FoundRows = TreeRow.Rows.FindRows(FilterStructure1,True);
			
			Area = Template.GetArea("TableQuestionCell");
			If FoundRows.Count() > 0 Then
				Area.Parameters.Value = FoundRows[0].Response;
			EndIf;
			ReportTable.Join(Area);
			
		EndDo;
		
	EndDo;
	
EndProcedure

&AtServer
Function ExecuteQueryOnQuestionnareQuestion()
	
	Query = New Query;
	Query.Text = "
	|SELECT
	|	ISNULL(DocumentQuestionnaire.Respondent, UNDEFINED) AS Respondent,
	|	QuestionnaireQuestionAnswers.CellNumber                  AS CellNumber,
	|	QuestionnaireQuestionAnswers.ElementaryQuestion           AS ElementaryQuestion,
	|	QuestionnaireQuestionAnswers.Response
	|FROM
	|	InformationRegister.QuestionnaireQuestionAnswers AS QuestionnaireQuestionAnswers
	|		LEFT JOIN Document.Questionnaire AS DocumentQuestionnaire
	|		ON QuestionnaireQuestionAnswers.Questionnaire = DocumentQuestionnaire.Ref
	|WHERE
	|	QuestionnaireQuestionAnswers.DoQueryBox = &TemplateQuestion
	|	AND DocumentQuestionnaire.Survey = &Survey
	|
	|ORDER BY
	|	Respondent,
	|	CellNumber
	|TOTALS BY
	|	Respondent,
	|	CellNumber";
	
	Query.SetParameter("TemplateQuestion",QuestionnaireTemplateQuestion);
	Query.SetParameter("Survey",Survey);
	
	Return Query.Execute();
	
EndFunction

&AtServer
Function ProcessIncomingParameters(BasicQuestionsFormulations)

	If Parameters.Property("QuestionnaireTemplateQuestion") Then
		QuestionnaireTemplateQuestion = Parameters.QuestionnaireTemplateQuestion;
	Else
		Return True;
	EndIf;
	
	If Parameters.Property("Survey") Then
		Survey = Parameters.Survey; 
	Else
		Return True;
	EndIf;
	
	If Parameters.Property("FullCode") Then
		FullCode =  Parameters.FullCode;
	EndIf;
	
	If Parameters.Property("SurveyDescription") Then
		SurveyDescription =  Parameters.SurveyDescription;
	Else
		Return True;
	EndIf; 
	
	If Parameters.Property("SurveyDate") Then
		SurveyDate =  Parameters.SurveyDate;
	Else
		Return True;
	EndIf;
	
	TemplateQuestionsAttributes = Common.ObjectAttributesValues(QuestionnaireTemplateQuestion,
		"TabularQuestionType,TableQuestionComposition,PredefinedAnswers,Wording");
	Wording           = TemplateQuestionsAttributes.Wording;
	TabularQuestionType   = TemplateQuestionsAttributes.TabularQuestionType;
	TableQuestionComposition.Load(TemplateQuestionsAttributes.TableQuestionComposition.Unload());
	PredefinedAnswers.Load(TemplateQuestionsAttributes.PredefinedAnswers.Unload());
	GetBasicQuestionsFormulations(BasicQuestionsFormulations);
	
	Title = StringFunctionsClientServer.SubstituteParametersToString(
		NStr("en = 'Responses to question %1 of survey %2, %3.';"), FullCode, SurveyDescription, Format(SurveyDate, "DLF=D"));
	
	Return False;

EndFunction

&AtServer
Procedure GetBasicQuestionsFormulations(BasicQuestionsFormulations)
	
	Query = New Query;
	Query.Text = "SELECT
	|	QuestionsForSurvey.Ref,
	|	QuestionsForSurvey.Wording,
	|	QuestionsForSurvey.ShowAggregatedValuesInReports
	|FROM
	|	ChartOfCharacteristicTypes.QuestionsForSurvey AS QuestionsForSurvey
	|WHERE
	|	QuestionsForSurvey.Ref IN(&QuestionsArray)";
	
	Query.SetParameter("QuestionsArray",TableQuestionComposition.Unload().UnloadColumn("ElementaryQuestion"));
	
	Selection = Query.Execute().Select();
	
	While Selection.Next() Do
		BasicQuestionsFormulations.Insert(Selection.Ref,Selection.Wording);
	EndDo;
	
EndProcedure

#EndRegion
